PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18f65j94.inc
;----- DMABCL Bits -----------------------------------------------------
BC0              EQU  H'0000'
BC1              EQU  H'0001'
BC2              EQU  H'0002'
BC3              EQU  H'0003'
BC4              EQU  H'0004'
BC5              EQU  H'0005'
BC6              EQU  H'0006'
BC7              EQU  H'0007'


;----- RXADDRH Bits -----------------------------------------------------
RXADDR8          EQU  H'0000'
RXADDR9          EQU  H'0001'
RXADDR10         EQU  H'0002'
RXADDR11         EQU  H'0003'


;----- RXADDRL Bits -----------------------------------------------------
RXADDR0          EQU  H'0000'
RXADDR1          EQU  H'0001'
RXADDR2          EQU  H'0002'
RXADDR3          EQU  H'0003'
RXADDR4          EQU  H'0004'
RXADDR5          EQU  H'0005'
RXADDR6          EQU  H'0006'
RXADDR7          EQU  H'0007'


;----- TXADDRH Bits -----------------------------------------------------
TXADDR8          EQU  H'0000'
TXADDR9          EQU  H'0001'
TXADDR10         EQU  H'0002'
TXADDR11         EQU  H'0003'


;----- TXADDRL Bits -----------------------------------------------------
TXADDR0          EQU  H'0000'
TXADDR1          EQU  H'0001'
TXADDR2          EQU  H'0002'
TXADDR3          EQU  H'0003'
TXADDR4          EQU  H'0004'
TXADDR5          EQU  H'0005'
TXADDR6          EQU  H'0006'
TXADDR7          EQU  H'0007'


;----- PORTVP Bits -----------------------------------------------------
RVP0             EQU  H'0000'
RVP1             EQU  H'0001'
RVP2             EQU  H'0002'
RVP3             EQU  H'0003'
RVP4             EQU  H'0004'
RVP5             EQU  H'0005'
RVP6             EQU  H'0006'
RVP7             EQU  H'0007'


;----- LATVP Bits -----------------------------------------------------
LATVP0           EQU  H'0000'
LATVP1           EQU  H'0001'
LATVP2           EQU  H'0002'
LATVP3           EQU  H'0003'
LATVP4           EQU  H'0004'
LATVP5           EQU  H'0005'
LATVP6           EQU  H'0006'
LATVP7           EQU  H'0007'


;----- TRISVP Bits -----------------------------------------------------
TRISVP0          EQU  H'0000'
TRISVP1          EQU  H'0001'
TRISVP2          EQU  H'0002'
TRISVP3          EQU  H'0003'
TRISVP4          EQU  H'0004'
TRISVP5          EQU  H'0005'
TRISVP6          EQU  H'0006'
TRISVP7          EQU  H'0007'


;----- UADDR Bits -----------------------------------------------------
ADDR0            EQU  H'0000'
ADDR1            EQU  H'0001'
ADDR2            EQU  H'0002'
ADDR3            EQU  H'0003'
ADDR4            EQU  H'0004'
ADDR5            EQU  H'0005'
ADDR6            EQU  H'0006'


;----- UCON Bits -----------------------------------------------------
SUSPND           EQU  H'0001'
RESUME           EQU  H'0002'
USBEN            EQU  H'0003'
PKTDIS           EQU  H'0004'
SE0              EQU  H'0005'
PPBRST           EQU  H'0006'


;----- USTAT Bits -----------------------------------------------------
PPBI             EQU  H'0001'
DIR              EQU  H'0002'

ENDP0            EQU  H'0003'
ENDP1            EQU  H'0004'
ENDP2            EQU  H'0005'
ENDP3            EQU  H'0006'


;----- UEIR Bits -----------------------------------------------------
PIDEF            EQU  H'0000'
CRC5EF           EQU  H'0001'
CRC16EF          EQU  H'0002'
DFN8EF           EQU  H'0003'
BTOEF            EQU  H'0004'
BTSEF            EQU  H'0007'


;----- UIR Bits -----------------------------------------------------
URSTIF           EQU  H'0000'
UERRIF           EQU  H'0001'
ACTVIF           EQU  H'0002'
TRNIF            EQU  H'0003'
IDLEIF           EQU  H'0004'
STALLIF          EQU  H'0005'
SOFIF            EQU  H'0006'


;----- UFRMH Bits -----------------------------------------------------
FRM8             EQU  H'0000'
FRM9             EQU  H'0001'
FRM10            EQU  H'0002'


;----- UFRML Bits -----------------------------------------------------
FRM0             EQU  H'0000'
FRM1             EQU  H'0001'
FRM2             EQU  H'0002'
FRM3             EQU  H'0003'
FRM4             EQU  H'0004'
FRM5             EQU  H'0005'
FRM6             EQU  H'0006'
FRM7             EQU  H'0007'


;----- RCON4 Bits -----------------------------------------------------
PMSLP            EQU  H'0000'
DPSLP            EQU  H'0002'
SRETEN           EQU  H'0004'


;----- RCON3 Bits -----------------------------------------------------
VBAT             EQU  H'0000'
VBPOR            EQU  H'0001'
VDDPOR           EQU  H'0002'
VDDBOR           EQU  H'0003'
STKERR           EQU  H'0007'


;----- RCON2 Bits -----------------------------------------------------
SWDTEN           EQU  H'0005'
EXTR             EQU  H'0007'


;----- EECON1 Bits -----------------------------------------------------
WR               EQU  H'0001'
WREN             EQU  H'0002'
WRERR            EQU  H'0003'
FREE             EQU  H'0004'
WWPROG           EQU  H'0005'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTD Bits -----------------------------------------------------
RD0              EQU  H'0000'
RD1              EQU  H'0001'
RD2              EQU  H'0002'
RD3              EQU  H'0003'
RD4              EQU  H'0004'
RD5              EQU  H'0005'
RD6              EQU  H'0006'
RD7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE0              EQU  H'0000'
RE1              EQU  H'0001'
RE2              EQU  H'0002'
RE3              EQU  H'0003'
RE4              EQU  H'0004'
RE5              EQU  H'0005'
RE6              EQU  H'0006'
RE7              EQU  H'0007'


;----- PORTF Bits -----------------------------------------------------
RF2              EQU  H'0002'
RF3              EQU  H'0003'
RF4              EQU  H'0004'
RF5              EQU  H'0005'
RF6              EQU  H'0006'
RF7              EQU  H'0007'


;----- PORTG Bits -----------------------------------------------------
RG0              EQU  H'0000'
RG1              EQU  H'0001'
RG2              EQU  H'0002'
RG3              EQU  H'0003'
RG4              EQU  H'0004'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


